[Summary - Cisco ESA Email Summary]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 40 * * * *
description = Email Summary for Cisco ESA
dispatch.earliest_time = -65m
dispatch.latest_time = -5m
enableSched = 1
search = sourcetype=cisco:esa:textmail NOT "Custom Log Entry" | eventstats values(src_ip) AS src_ip BY icid | eventstats values(dest_ip) AS dest_ip BY dcid | stats values(internal_message_id) AS tmpinternal_message_id values(icid) AS icid first(_time) AS first_time values(action) AS action values(file_name) AS file_name values(message_subject) AS subject values(signature) AS signature values(signature_type) AS signature_extra values(user) AS user values(sender) AS sender values(recipient) AS recipient values(message_size) AS message_size values(message_id) AS message_id values(src_ip) AS src_ip values(dest_ip) AS dest_ip values(dcid) AS dcid BY internal_message_id | eval recipient_count=mvcount(recipient) | eval internal_message_id=tmpinternal_message_id | mvexpand internal_message_id | eventstats values(tmpinternal_message_id) AS tmp BY internal_message_id | eval msg=mvjoin(tmp, " ") | rex field=sender "@(?<sender_domain>.*)" | stats values(icid) AS icid first(first_time) AS _time values(action) AS action values(file_name) AS file_name values(subject) AS subject values(signature) AS signature values(signature_extra) AS signature_extra values(user) AS user values(sender) AS sender values(sender_domain) AS sender_domain values(recipient) AS recipient max(message_size) AS message_size max(recipient_count) AS recipient_count values(message_id) AS message_id values(dcid) AS dcid values(tmp) as internal_message_id values(src_ip) AS src_ip values(dest_ip) AS dest_ip BY msg | collect sourcetype=cisco:esa:summary:email
# THIS ONE ALSO GETS AMP events - but must be tagged correctly!! Also note that sourcetype is cisco:esa:legacy. Add smart props EVALs instead of inline
search = sourcetype=cisco:esa:textmail OR sourcetype=cisco:esa:legacy NOT "Custom Log Entry" | eval internal_message_id=coalesce(internal_message_id, MID) | eval file_name=coalesce(file_name, Name) | eventstats values(src_ip) AS src_ip BY icid | eventstats values(dest_ip) AS dest_ip BY dcid | stats values(internal_message_id) AS tmpinternal_message_id values(icid) AS icid first(_time) AS first_time values(action) AS action values(file_name) AS file_name values(message_subject) AS subject values(signature) AS signature values(signature_type) AS signature_extra values(user) AS user values(sender) AS sender values(recipient) AS recipient values(message_size) AS message_size values(message_id) AS message_id values(src_ip) AS src_ip values(dest_ip) AS dest_ip values(dcid) AS dcid values(Disposition) AS Disposition values(sha256) AS file_hash values(Size) AS file_size values(Malware) AS Malware BY internal_message_id | eval recipient_count=mvcount(recipient) | eval internal_message_id=tmpinternal_message_id | mvexpand internal_message_id | eventstats values(tmpinternal_message_id) AS tmp BY internal_message_id | eval msg=mvjoin(tmp, " ") | rex field=sender "@(?<sender_domain>.*)" | stats values(icid) AS icid first(first_time) AS _time values(action) AS action values(file_name) AS file_name values(subject) AS subject values(signature) AS signature values(signature_extra) AS signature_extra values(user) AS user values(sender) AS sender values(sender_domain) AS sender_domain values(recipient) AS recipient max(message_size) AS message_size max(recipient_count) AS recipient_count values(message_id) AS message_id values(dcid) AS dcid values(Disposition) AS Disposition values(file_hash) AS file_hash values(file_size) AS file_size values(Malware) AS Malware values(tmp) as internal_message_id values(src_ip) AS src_ip values(dest_ip) AS dest_ip BY msg
